input:"data_4"
input_dim:1
input_dim:3
input_dim:320
input_dim:180

input:"data_2"
input_dim:1
input_dim:3
input_dim:640
input_dim:360

input:"data_1"
input_dim:1
input_dim:3
input_dim:1280
input_dim:720

###################################################

layer {
  name: "prepro1_1"
  type: "Convolution"
  bottom: "data_1"
  top: "prepro1_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "prepro1_2"
  type: "Convolution"
  bottom: "prepro1_1"
  top: "prepro1_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "Cdarkchannel1_1"
  type: "Convolution"
  bottom: "prepro1_2"
  top: "Cdarkchannel1_1"
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "Cwhitechannel1_1"
  type: "Convolution"
  bottom: "prepro1_2"
  top: "Cwhitechannel1_1"
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "prepro1_2b"
  type: "Convolution"
  bottom: "prepro1_2"
  top: "prepro1_2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "eltwiseDWD1_1"
  type: "Concat"
  bottom: "prepro1_2b"
  bottom: "Cdarkchannel1_1"
  bottom: "Cwhitechannel1_1"
  top: "eltwiseDWD1_1"
}

layer {
  name: "prepro1_3"
  type: "Convolution"
  bottom: "eltwiseDWD1_1"
  top: "prepro1_3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "prepro1_3"
  top: "conv1_1"
  param {name: "conv1_w"}
  param {name: "conv1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {name: "conv2_w"}
  param {name: "conv2_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_1a"
  type: "Convolution"
  bottom: "conv1_2"
  top: "RDB1_1a"
  param {name: "RDB1a_w"}
  param {name: "RDB1a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_1a_PReLU"
  type: "PReLU"
  bottom: "RDB1_1a"
  top: "RDB1_1a"
}

layer {
  name: "RDB1_1a1"
  type: "Convolution"
  bottom: "RDB1_1a"
  top: "RDB1_1a1"
  param {name: "RDB1a1_w"}
  param {name: "RDB1a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_1_Eltwise1"
  type: "Eltwise"
  bottom: "conv1_2"
  bottom: "RDB1_1a1"
  top: "RDB1_1_Eltwise1"
}

layer {
  name: "RDB1_1b"
  type: "Convolution"
  bottom: "RDB1_1_Eltwise1"
  top: "RDB1_1b"
  param {name: "RDB1b_w"}
  param {name: "RDB1b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_1b_PReLU"
  type: "PReLU"
  bottom: "RDB1_1b"
  top: "RDB1_1b"
}

layer {
  name: "RDB1_1b1"
  type: "Convolution"
  bottom: "RDB1_1b"
  top: "RDB1_1b1"
  param {name: "RDB1b1_w"}
  param {name: "RDB1b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_1_Eltwise2"
  type: "Eltwise"
  bottom: "RDB1_1b1"
  bottom: "RDB1_1_Eltwise1"
  top: "RDB1_1_Eltwise2"
}

layer {
  name: "RDB1_1c"
  type: "Convolution"
  bottom: "RDB1_1_Eltwise2"
  top: "RDB1_1c"
  param {name: "RDB1c_w"}
  param {name: "RDB1c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB1_1c_PReLU"
  type: "PReLU"
  bottom: "RDB1_1c"
  top: "RDB1_1c"
}

layer {
  name: "RDB1_1c1"
  type: "Convolution"
  bottom: "RDB1_1c"
  top: "RDB1_1c1"
  param {name: "RDB1c1_w"}
  param {name: "RDB1c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_1_Eltwise3"
  type: "Eltwise"
  bottom: "RDB1_1_Eltwise2"
  bottom: "RDB1_1c1"
  top: "RDB1_1_Eltwise3"
}

layer {
  name: "RDB1_1d"
  type: "Convolution"
  bottom: "RDB1_1_Eltwise3"
  top: "RDB1_1d"
  param {name: "RDB1d_w"}
  param {name: "RDB1d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB1_1d_Sum"
	type: "Eltwise"
	bottom: "conv1_2"
	bottom: "RDB1_1d"
	top: "RDB1_1d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB1_2a"
  type: "Convolution"
  bottom: "RDB1_1d_Sum"
  top: "RDB1_2a"
  param {name: "RDB2a_w"}
  param {name: "RDB2a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_2a_PReLU"
  type: "PReLU"
  bottom: "RDB1_2a"
  top: "RDB1_2a"
}

layer {
  name: "RDB1_2a1"
  type: "Convolution"
  bottom: "RDB1_2a"
  top: "RDB1_2a1"
  param {name: "RDB2a1_w"}
  param {name: "RDB2a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_2_Eltwise1"
  type: "Eltwise"
  bottom: "RDB1_1d_Sum"
  bottom: "RDB1_2a1"
  top: "RDB1_2_Eltwise1"
}

layer {
  name: "RDB1_2b"
  type: "Convolution"
  bottom: "RDB1_2_Eltwise1"
  top: "RDB1_2b"
  param {name: "RDB2b_w"}
  param {name: "RDB2b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_2b_PReLU"
  type: "PReLU"
  bottom: "RDB1_2b"
  top: "RDB1_2b"
}

layer {
  name: "RDB1_2b1"
  type: "Convolution"
  bottom: "RDB1_2b"
  top: "RDB1_2b1"
  param {name: "RDB2b1_w"}
  param {name: "RDB2b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_2_Eltwise2"
  type: "Eltwise"
  bottom: "RDB1_2b1"
  bottom: "RDB1_2_Eltwise1"
  top: "RDB1_2_Eltwise2"
}

layer {
  name: "RDB1_2c"
  type: "Convolution"
  bottom: "RDB1_2_Eltwise2"
  top: "RDB1_2c"
  param {name: "RDB2c_w"}
  param {name: "RDB2c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB1_2c_PReLU"
  type: "PReLU"
  bottom: "RDB1_2c"
  top: "RDB1_2c"
}

layer {
  name: "RDB1_2c1"
  type: "Convolution"
  bottom: "RDB1_2c"
  top: "RDB1_2c1"
  param {name: "RDB2c1_w"}
  param {name: "RDB2c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_2_Eltwise3"
  type: "Eltwise"
  bottom: "RDB1_2_Eltwise2"
  bottom: "RDB1_2c1"
  top: "RDB1_2_Eltwise3"
}


layer {
  name: "RDB1_2d"
  type: "Convolution"
  bottom: "RDB1_2_Eltwise3"
  top: "RDB1_2d"
  param {name: "RDB2d_w"}
  param {name: "RDB2d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB1_2d_Sum"
	type: "Eltwise"
	bottom: "RDB1_1d_Sum"
	bottom: "RDB1_2d"
	top: "RDB1_2d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB1_3a"
  type: "Convolution"
  bottom: "RDB1_2d_Sum"
  top: "RDB1_3a"
  param {name: "RDB3a_w"}
  param {name: "RDB3a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_3a_PReLU"
  type: "PReLU"
  bottom: "RDB1_3a"
  top: "RDB1_3a"
}

layer {
  name: "RDB1_3a1"
  type: "Convolution"
  bottom: "RDB1_3a"
  top: "RDB1_3a1"
  param {name: "RDB3a1_w"}
  param {name: "RDB3a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_3_Eltwise1"
  type: "Eltwise"
  bottom: "RDB1_2d_Sum"
  bottom: "RDB1_3a1"
  top: "RDB1_3_Eltwise1"
}

layer {
  name: "RDB1_3b"
  type: "Convolution"
  bottom: "RDB1_3_Eltwise1"
  top: "RDB1_3b"
  param {name: "RDB3b_w"}
  param {name: "RDB3b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_3b_PReLU"
  type: "PReLU"
  bottom: "RDB1_3b"
  top: "RDB1_3b"
}

layer {
  name: "RDB1_3b1"
  type: "Convolution"
  bottom: "RDB1_3b"
  top: "RDB1_3b1"
  param {name: "RDB3b1_w"}
  param {name: "RDB3b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_3_Eltwise2"
  type: "Eltwise"
  bottom: "RDB1_3b1"
  bottom: "RDB1_3_Eltwise1"
  top: "RDB1_3_Eltwise2"
}
layer {
  name: "RDB1_3c"
  type: "Convolution"
  bottom: "RDB1_3_Eltwise2"
  top: "RDB1_3c"
  param {name: "RDB3c_w"}
  param {name: "RDB3c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB1_3c_PReLU"
  type: "PReLU"
  bottom: "RDB1_3c"
  top: "RDB1_3c"
}

layer {
  name: "RDB1_3c1"
  type: "Convolution"
  bottom: "RDB1_3c"
  top: "RDB1_3c1"
  param {name: "RDB3c1_w"}
  param {name: "RDB3c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_3_Eltwise3"
  type: "Eltwise"
  bottom: "RDB1_3_Eltwise2"
  bottom: "RDB1_3c1"
  top: "RDB1_3_Eltwise3"
}

layer {
  name: "RDB1_3d"
  type: "Convolution"
  bottom: "RDB1_3_Eltwise3"
  top: "RDB1_3d"
  param {name: "RDB3d_w"}
  param {name: "RDB3d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB1_3d_Sum"
	type: "Eltwise"
	bottom: "RDB1_2d_Sum"
	bottom: "RDB1_3d"
	top: "RDB1_3d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB1_4a"
  type: "Convolution"
  bottom: "RDB1_3d_Sum"
  top: "RDB1_4a"
  param {name: "RDB4a_w"}
  param {name: "RDB4a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_4a_PReLU"
  type: "PReLU"
  bottom: "RDB1_4a"
  top: "RDB1_4a"
}

layer {
  name: "RDB1_4a1"
  type: "Convolution"
  bottom: "RDB1_4a"
  top: "RDB1_4a1"
  param {name: "RDB4a1_w"}
  param {name: "RDB4a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB1_4_Eltwise1"
  type: "Eltwise"
  bottom: "RDB1_3d_Sum"
  bottom: "RDB1_4a1"
  top: "RDB1_4_Eltwise1"
}

layer {
  name: "RDB1_4b"
  type: "Convolution"
  bottom: "RDB1_4_Eltwise1"
  top: "RDB1_4b"
  param {name: "RDB4b_w"}
  param {name: "RDB4b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB1_4b_PReLU"
  type: "PReLU"
  bottom: "RDB1_4b"
  top: "RDB1_4b"
}

layer {
  name: "RDB1_4b1"
  type: "Convolution"
  bottom: "RDB1_4b"
  top: "RDB1_4b1"
  param {name: "RDB4b1_w"}
  param {name: "RDB4b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}


layer {
  name: "RDB1_4_Eltwise2"
  type: "Eltwise"
  bottom: "RDB1_4b1"
  bottom: "RDB1_4_Eltwise1"
  top: "RDB1_4_Eltwise2"
}

layer {
  name: "RDB1_4c"
  type: "Convolution"
  bottom: "RDB1_4_Eltwise2"
  top: "RDB1_4c"
  param {name: "RDB4c_w"}
  param {name: "RDB4c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB1_4c_PReLU"
  type: "PReLU"
  bottom: "RDB1_4c"
  top: "RDB1_4c"
}

layer {
  name: "RDB1_4c1"
  type: "Convolution"
  bottom: "RDB1_4c"
  top: "RDB1_4c1"
  param {name: "RDB4c1_w"}
  param {name: "RDB4c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}


layer {
  name: "RDB1_4_Eltwise3"
  type: "Eltwise"
  bottom: "RDB1_4_Eltwise2"
  bottom: "RDB1_4c1"
  top: "RDB1_4_Eltwise3"
}

layer {
  name: "RDB1_4d"
  type: "Convolution"
  bottom: "RDB1_4_Eltwise3"
  top: "RDB1_4d"
  param {name: "RDB4d_w"}
  param {name: "RDB4d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB1_4d_Sum"
	type: "Eltwise"
	bottom: "RDB1_3d_Sum"
	bottom: "RDB1_4d"
	top: "RDB1_4d_Sum"
	eltwise_param {
	  operation: 1
	}
}

#################################################

##################################################
layer {
  name: "prepro2_1"
  type: "Convolution"
  bottom: "data_2"
  top: "prepro2_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "prepro2_2"
  type: "Convolution"
  bottom: "prepro2_1"
  top: "prepro2_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "Concat1_2_a"
  type: "Concat"
  bottom: "conv1_1"
  bottom: "prepro2_2"
  top: "Concat1_2_a"
}

layer {
  name: "Cdarkchannel2_1"
  type: "Convolution"
  bottom: "Concat1_2_a"
  top: "Cdarkchannel2_1"
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "Cwhitechannel2_1"
  type: "Convolution"
  bottom: "Concat1_2_a"
  top: "Cwhitechannel2_1"
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "prepro2_2b"
  type: "Convolution"
  bottom: "Concat1_2_a"
  top: "prepro2_2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "eltwiseDWD2_1"
  type: "Concat"
  bottom: "prepro2_2b"
  bottom: "Cdarkchannel2_1"
  bottom: "Cwhitechannel2_1"
  top: "eltwiseDWD2_1"
}

layer {
  name: "prepro2_3"
  type: "Convolution"
  bottom: "eltwiseDWD2_1"
  top: "prepro2_3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "prepro2_3"
  top: "conv2_1"
  param {name: "conv1_w"}
  param {name: "conv1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {name: "conv2_w"}
  param {name: "conv2_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_1a"
  type: "Convolution"
  bottom: "conv2_2"
  top: "RDB2_1a"
  param {name: "RDB1a_w"}
  param {name: "RDB1a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_1a_PReLU"
  type: "PReLU"
  bottom: "RDB2_1a"
  top: "RDB2_1a"
}

layer {
  name: "RDB2_1a1"
  type: "Convolution"
  bottom: "RDB2_1a"
  top: "RDB2_1a1"
  param {name: "RDB1a1_w"}
  param {name: "RDB1a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_1_Eltwise1"
  type: "Eltwise"
  bottom: "conv2_2"
  bottom: "RDB2_1a1"
  top: "RDB2_1_Eltwise1"
}

layer {
  name: "RDB2_1b"
  type: "Convolution"
  bottom: "RDB2_1_Eltwise1"
  top: "RDB2_1b"
  param {name: "RDB1b_w"}
  param {name: "RDB1b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_1b_PReLU"
  type: "PReLU"
  bottom: "RDB2_1b"
  top: "RDB2_1b"
}

layer {
  name: "RDB2_1b1"
  type: "Convolution"
  bottom: "RDB2_1b"
  top: "RDB2_1b1"
  param {name: "RDB1b1_w"}
  param {name: "RDB1b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_1_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_1b1"
  bottom: "RDB2_1_Eltwise1"
  top: "RDB2_1_Eltwise2"
}

layer {
  name: "RDB2_1c"
  type: "Convolution"
  bottom: "RDB2_1_Eltwise2"
  top: "RDB2_1c"
  param {name: "RDB1c_w"}
  param {name: "RDB1c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_1c_PReLU"
  type: "PReLU"
  bottom: "RDB2_1c"
  top: "RDB2_1c"
}

layer {
  name: "RDB2_1c1"
  type: "Convolution"
  bottom: "RDB2_1c"
  top: "RDB2_1c1"
  param {name: "RDB1c1_w"}
  param {name: "RDB1c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_1_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_1_Eltwise2"
  bottom: "RDB2_1c1"
  top: "RDB2_1_Eltwise3"
}

layer {
  name: "RDB2_1d"
  type: "Convolution"
  bottom: "RDB2_1_Eltwise3"
  top: "RDB2_1d"
  param {name: "RDB1d_w"}
  param {name: "RDB1d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_1d_Sum"
	type: "Eltwise"
	bottom: "conv2_2"
	bottom: "RDB2_1d"
	top: "RDB2_1d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_2a"
  type: "Convolution"
  bottom: "RDB2_1d_Sum"
  top: "RDB2_2a"
  param {name: "RDB2a_w"}
  param {name: "RDB2a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_2a_PReLU"
  type: "PReLU"
  bottom: "RDB2_2a"
  top: "RDB2_2a"
}

layer {
  name: "RDB2_2a1"
  type: "Convolution"
  bottom: "RDB2_2a"
  top: "RDB2_2a1"
  param {name: "RDB2a1_w"}
  param {name: "RDB2a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_2_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_1d_Sum"
  bottom: "RDB2_2a1"
  top: "RDB2_2_Eltwise1"
}

layer {
  name: "RDB2_2b"
  type: "Convolution"
  bottom: "RDB2_2_Eltwise1"
  top: "RDB2_2b"
  param {name: "RDB2b_w"}
  param {name: "RDB2b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_2b_PReLU"
  type: "PReLU"
  bottom: "RDB2_2b"
  top: "RDB2_2b"
}

layer {
  name: "RDB2_2b1"
  type: "Convolution"
  bottom: "RDB2_2b"
  top: "RDB2_2b1"
  param {name: "RDB2b1_w"}
  param {name: "RDB2b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_2_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_2b1"
  bottom: "RDB2_2_Eltwise1"
  top: "RDB2_2_Eltwise2"
}

layer {
  name: "RDB2_2c"
  type: "Convolution"
  bottom: "RDB2_2_Eltwise2"
  top: "RDB2_2c"
  param {name: "RDB2c_w"}
  param {name: "RDB2c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_2c_PReLU"
  type: "PReLU"
  bottom: "RDB2_2c"
  top: "RDB2_2c"
}

layer {
  name: "RDB2_2c1"
  type: "Convolution"
  bottom: "RDB2_2c"
  top: "RDB2_2c1"
  param {name: "RDB2c1_w"}
  param {name: "RDB2c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_2_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_2_Eltwise2"
  bottom: "RDB2_2c1"
  top: "RDB2_2_Eltwise3"
}


layer {
  name: "RDB2_2d"
  type: "Convolution"
  bottom: "RDB2_2_Eltwise3"
  top: "RDB2_2d"
  param {name: "RDB2d_w"}
  param {name: "RDB2d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_2d_Sum"
	type: "Eltwise"
	bottom: "RDB2_1d_Sum"
	bottom: "RDB2_2d"
	top: "RDB2_2d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_3a"
  type: "Convolution"
  bottom: "RDB2_2d_Sum"
  top: "RDB2_3a"
  param {name: "RDB3a_w"}
  param {name: "RDB3a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_3a_PReLU"
  type: "PReLU"
  bottom: "RDB2_3a"
  top: "RDB2_3a"
}

layer {
  name: "RDB2_3a1"
  type: "Convolution"
  bottom: "RDB2_3a"
  top: "RDB2_3a1"
  param {name: "RDB3a1_w"}
  param {name: "RDB3a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_3_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_2d_Sum"
  bottom: "RDB2_3a1"
  top: "RDB2_3_Eltwise1"
}

layer {
  name: "RDB2_3b"
  type: "Convolution"
  bottom: "RDB2_3_Eltwise1"
  top: "RDB2_3b"
  param {name: "RDB3b_w"}
  param {name: "RDB3b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_3b_PReLU"
  type: "PReLU"
  bottom: "RDB2_3b"
  top: "RDB2_3b"
}

layer {
  name: "RDB2_3b1"
  type: "Convolution"
  bottom: "RDB2_3b"
  top: "RDB2_3b1"
  param {name: "RDB3b1_w"}
  param {name: "RDB3b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_3_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_3b1"
  bottom: "RDB2_3_Eltwise1"
  top: "RDB2_3_Eltwise2"
}
layer {
  name: "RDB2_3c"
  type: "Convolution"
  bottom: "RDB2_3_Eltwise2"
  top: "RDB2_3c"
  param {name: "RDB3c_w"}
  param {name: "RDB3c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_3c_PReLU"
  type: "PReLU"
  bottom: "RDB2_3c"
  top: "RDB2_3c"
}

layer {
  name: "RDB2_3c1"
  type: "Convolution"
  bottom: "RDB2_3c"
  top: "RDB2_3c1"
  param {name: "RDB3c1_w"}
  param {name: "RDB3c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_3_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_3_Eltwise2"
  bottom: "RDB2_3c1"
  top: "RDB2_3_Eltwise3"
}

layer {
  name: "RDB2_3d"
  type: "Convolution"
  bottom: "RDB2_3_Eltwise3"
  top: "RDB2_3d"
  param {name: "RDB3d_w"}
  param {name: "RDB3d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_3d_Sum"
	type: "Eltwise"
	bottom: "RDB2_2d_Sum"
	bottom: "RDB2_3d"
	top: "RDB2_3d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_4a"
  type: "Convolution"
  bottom: "RDB2_3d_Sum"
  top: "RDB2_4a"
  param {name: "RDB4a_w"}
  param {name: "RDB4a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_4a_PReLU"
  type: "PReLU"
  bottom: "RDB2_4a"
  top: "RDB2_4a"
}

layer {
  name: "RDB2_4a1"
  type: "Convolution"
  bottom: "RDB2_4a"
  top: "RDB2_4a1"
  param {name: "RDB4a1_w"}
  param {name: "RDB4a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_4_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_3d_Sum"
  bottom: "RDB2_4a1"
  top: "RDB2_4_Eltwise1"
}

layer {
  name: "RDB2_4b"
  type: "Convolution"
  bottom: "RDB2_4_Eltwise1"
  top: "RDB2_4b"
  param {name: "RDB4b_w"}
  param {name: "RDB4b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_4b_PReLU"
  type: "PReLU"
  bottom: "RDB2_4b"
  top: "RDB2_4b"
}

layer {
  name: "RDB2_4b1"
  type: "Convolution"
  bottom: "RDB2_4b"
  top: "RDB2_4b1"
  param {name: "RDB4b1_w"}
  param {name: "RDB4b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}


layer {
  name: "RDB2_4_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_4b1"
  bottom: "RDB2_4_Eltwise1"
  top: "RDB2_4_Eltwise2"
}

layer {
  name: "RDB2_4c"
  type: "Convolution"
  bottom: "RDB2_4_Eltwise2"
  top: "RDB2_4c"
  param {name: "RDB4c_w"}
  param {name: "RDB4c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_4c_PReLU"
  type: "PReLU"
  bottom: "RDB2_4c"
  top: "RDB2_4c"
}

layer {
  name: "RDB2_4c1"
  type: "Convolution"
  bottom: "RDB2_4c"
  top: "RDB2_4c1"
  param {name: "RDB4c1_w"}
  param {name: "RDB4c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}


layer {
  name: "RDB2_4_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_4_Eltwise2"
  bottom: "RDB2_4c1"
  top: "RDB2_4_Eltwise3"
}

layer {
  name: "RDB2_4d"
  type: "Convolution"
  bottom: "RDB2_4_Eltwise3"
  top: "RDB2_4d"
  param {name: "RDB4d_w"}
  param {name: "RDB4d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_4d_Sum"
	type: "Eltwise"
	bottom: "RDB2_3d_Sum"
	bottom: "RDB2_4d"
	top: "RDB2_4d_Sum"
	eltwise_param {
	  operation: 1
	}
}

####################################################

layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "RDB2_4d_Sum"
  top: "conv2_3"
  param {name: "conv3_w"}
  param {name: "conv3_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "conv2_3"
  top: "conv2_4"
  param {name: "conv4_w"}
  param {name: "conv4_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_5a"
  type: "Convolution"
  bottom: "conv2_4"
  top: "RDB2_5a"
  param {name: "RDB5a_w"}
  param {name: "RDB5a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_5a_PReLU"
  type: "PReLU"
  bottom: "RDB2_5a"
  top: "RDB2_5a"
}

layer {
  name: "RDB2_5a1"
  type: "Convolution"
  bottom: "RDB2_5a"
  top: "RDB2_5a1"
  param {name: "RDB5a1_w"}
  param {name: "RDB5a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_5_Eltwise1"
  type: "Eltwise"
  bottom: "conv2_4"
  bottom: "RDB2_5a1"
  top: "RDB2_5_Eltwise1"
}

layer {
  name: "RDB2_5b"
  type: "Convolution"
  bottom: "RDB2_5_Eltwise1"
  top: "RDB2_5b"
  param {name: "RDB5b_w"}
  param {name: "RDB5b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_5b_PReLU"
  type: "PReLU"
  bottom: "RDB2_5b"
  top: "RDB2_5b"
}

layer {
  name: "RDB2_5b1"
  type: "Convolution"
  bottom: "RDB2_5b"
  top: "RDB2_5b1"
  param {name: "RDB5b1_w"}
  param {name: "RDB5b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_5_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_5b1"
  bottom: "RDB2_5_Eltwise1"
  top: "RDB2_5_Eltwise2"
}

layer {
  name: "RDB2_5c"
  type: "Convolution"
  bottom: "RDB2_5_Eltwise2"
  top: "RDB2_5c"
  param {name: "RDB5c_w"}
  param {name: "RDB5c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_5c_PReLU"
  type: "PReLU"
  bottom: "RDB2_5c"
  top: "RDB2_5c"
}

layer {
  name: "RDB2_5c1"
  type: "Convolution"
  bottom: "RDB2_5c"
  top: "RDB2_5c1"
  param {name: "RDB5c1_w"}
  param {name: "RDB5c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_5_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_5_Eltwise2"
  bottom: "RDB2_5c1"
  top: "RDB2_5_Eltwise3"
}

layer {
  name: "RDB2_5d"
  type: "Convolution"
  bottom: "RDB2_5_Eltwise3"
  top: "RDB2_5d"
  param {name: "RDB5d_w"}
  param {name: "RDB5d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_5d_Sum"
	type: "Eltwise"
	bottom: "conv2_4"
	bottom: "RDB2_5d"
	top: "RDB2_5d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_6a"
  type: "Convolution"
  bottom: "RDB2_5d_Sum"
  top: "RDB2_6a"
  param {name: "RDB6a_w"}
  param {name: "RDB6a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_6a_PReLU"
  type: "PReLU"
  bottom: "RDB2_6a"
  top: "RDB2_6a"
}

layer {
  name: "RDB2_6a1"
  type: "Convolution"
  bottom: "RDB2_6a"
  top: "RDB2_6a1"
  param {name: "RDB6a1_w"}
  param {name: "RDB6a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_6_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_5d_Sum"
  bottom: "RDB2_6a1"
  top: "RDB2_6_Eltwise1"
}

layer {
  name: "RDB2_6b"
  type: "Convolution"
  bottom: "RDB2_6_Eltwise1"
  top: "RDB2_6b"
  param {name: "RDB6b_w"}
  param {name: "RDB6b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_6b_PReLU"
  type: "PReLU"
  bottom: "RDB2_6b"
  top: "RDB2_6b"
}

layer {
  name: "RDB2_6b1"
  type: "Convolution"
  bottom: "RDB2_6b"
  top: "RDB2_6b1"
  param {name: "RDB6b1_w"}
  param {name: "RDB6b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_6_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_6b1"
  bottom: "RDB2_6_Eltwise1"
  top: "RDB2_6_Eltwise2"
}

layer {
  name: "RDB2_6c"
  type: "Convolution"
  bottom: "RDB2_6_Eltwise2"
  top: "RDB2_6c"
  param {name: "RDB6c_w"}
  param {name: "RDB6c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_6c_PReLU"
  type: "PReLU"
  bottom: "RDB2_6c"
  top: "RDB2_6c"
}

layer {
  name: "RDB2_6c1"
  type: "Convolution"
  bottom: "RDB2_6c"
  top: "RDB2_6c1"
  param {name: "RDB6c1_w"}
  param {name: "RDB6c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_6_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_6_Eltwise2"
  bottom: "RDB2_6c1"
  top: "RDB2_6_Eltwise3"
}

layer {
  name: "RDB2_6d"
  type: "Convolution"
  bottom: "RDB2_6_Eltwise3"
  top: "RDB2_6d"
  param {name: "RDB6d_w"}
  param {name: "RDB6d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_6d_Sum"
	type: "Eltwise"
	bottom: "RDB2_5d_Sum"
	bottom: "RDB2_6d"
	top: "RDB2_6d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_7a"
  type: "Convolution"
  bottom: "RDB2_6d_Sum"
  top: "RDB2_7a"
  param {name: "RDB7a_w"}
  param {name: "RDB7a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_7a_PReLU"
  type: "PReLU"
  bottom: "RDB2_7a"
  top: "RDB2_7a"
}

layer {
  name: "RDB2_7a1"
  type: "Convolution"
  bottom: "RDB2_7a"
  top: "RDB2_7a1"
  param {name: "RDB7a1_w"}
  param {name: "RDB7a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_7_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_6d_Sum"
  bottom: "RDB2_7a1"
  top: "RDB2_7_Eltwise1"
}

layer {
  name: "RDB2_7b"
  type: "Convolution"
  bottom: "RDB2_7_Eltwise1"
  top: "RDB2_7b"
  param {name: "RDB7b_w"}
  param {name: "RDB7b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_7b_PReLU"
  type: "PReLU"
  bottom: "RDB2_7b"
  top: "RDB2_7b"
}

layer {
  name: "RDB2_7b1"
  type: "Convolution"
  bottom: "RDB2_7b"
  top: "RDB2_7b1"
  param {name: "RDB7b1_w"}
  param {name: "RDB7b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_7_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_7b1"
  bottom: "RDB2_7_Eltwise1"
  top: "RDB2_7_Eltwise2"
}

layer {
  name: "RDB2_7c"
  type: "Convolution"
  bottom: "RDB2_7_Eltwise2"
  top: "RDB2_7c"
  param {name: "RDB7c_w"}
  param {name: "RDB7c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_7c_PReLU"
  type: "PReLU"
  bottom: "RDB2_7c"
  top: "RDB2_7c"
}

layer {
  name: "RDB2_7c1"
  type: "Convolution"
  bottom: "RDB2_7c"
  top: "RDB2_7c1"
  param {name: "RDB7c1_w"}
  param {name: "RDB7c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_7_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_7_Eltwise2"
  bottom: "RDB2_7c1"
  top: "RDB2_7_Eltwise3"
}

layer {
  name: "RDB2_7d"
  type: "Convolution"
  bottom: "RDB2_7_Eltwise3"
  top: "RDB2_7d"
  param {name: "RDB7d_w"}
  param {name: "RDB7d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_7d_Sum"
	type: "Eltwise"
	bottom: "RDB2_6d_Sum"
	bottom: "RDB2_7d"
	top: "RDB2_7d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_8a"
  type: "Convolution"
  bottom: "RDB2_7d_Sum"
  top: "RDB2_8a"
  param {name: "RDB8a_w"}
  param {name: "RDB8a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_8a_PReLU"
  type: "PReLU"
  bottom: "RDB2_8a"
  top: "RDB2_8a"
}

layer {
  name: "RDB2_8a1"
  type: "Convolution"
  bottom: "RDB2_8a"
  top: "RDB2_8a1"
  param {name: "RDB8a1_w"}
  param {name: "RDB8a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_8_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_7d_Sum"
  bottom: "RDB2_8a1"
  top: "RDB2_8_Eltwise1"
}

layer {
  name: "RDB2_8b"
  type: "Convolution"
  bottom: "RDB2_8_Eltwise1"
  top: "RDB2_8b"
  param {name: "RDB8b_w"}
  param {name: "RDB8b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_8b_PReLU"
  type: "PReLU"
  bottom: "RDB2_8b"
  top: "RDB2_8b"
}

layer {
  name: "RDB2_8b1"
  type: "Convolution"
  bottom: "RDB2_8b"
  top: "RDB2_8b1"
  param {name: "RDB8b1_w"}
  param {name: "RDB8b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_8_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_8b1"
  bottom: "RDB2_8_Eltwise1"
  top: "RDB2_8_Eltwise2"
}

layer {
  name: "RDB2_8c"
  type: "Convolution"
  bottom: "RDB2_8_Eltwise2"
  top: "RDB2_8c"
  param {name: "RDB8c_w"}
  param {name: "RDB8c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_8c_PReLU"
  type: "PReLU"
  bottom: "RDB2_8c"
  top: "RDB2_8c"
}

layer {
  name: "RDB2_8c1"
  type: "Convolution"
  bottom: "RDB2_8c"
  top: "RDB2_8c1"
  param {name: "RDB8c1_w"}
  param {name: "RDB8c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_8_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_8_Eltwise2"
  bottom: "RDB2_8c1"
  top: "RDB2_8_Eltwise3"
}

layer {
  name: "RDB2_8d"
  type: "Convolution"
  bottom: "RDB2_8_Eltwise3"
  top: "RDB2_8d"
  param {name: "RDB8d_w"}
  param {name: "RDB8d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_8d_Sum"
	type: "Eltwise"
	bottom: "RDB2_7d_Sum"
	bottom: "RDB2_8d"
	top: "RDB2_8d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_9a"
  type: "Convolution"
  bottom: "RDB2_8d_Sum"
  top: "RDB2_9a"
  param {name: "RDB9a_w"}
  param {name: "RDB9a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_9a_PReLU"
  type: "PReLU"
  bottom: "RDB2_9a"
  top: "RDB2_9a"
}

layer {
  name: "RDB2_9a1"
  type: "Convolution"
  bottom: "RDB2_9a"
  top: "RDB2_9a1"
  param {name: "RDB9a1_w"}
  param {name: "RDB9a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_9_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_8d_Sum"
  bottom: "RDB2_9a1"
  top: "RDB2_9_Eltwise1"
}

layer {
  name: "RDB2_9b"
  type: "Convolution"
  bottom: "RDB2_9_Eltwise1"
  top: "RDB2_9b"
  param {name: "RDB9b_w"}
  param {name: "RDB9b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_9b_PReLU"
  type: "PReLU"
  bottom: "RDB2_9b"
  top: "RDB2_9b"
}

layer {
  name: "RDB2_9b1"
  type: "Convolution"
  bottom: "RDB2_9b"
  top: "RDB2_9b1"
  param {name: "RDB9b1_w"}
  param {name: "RDB9b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_9_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_9b1"
  bottom: "RDB2_9_Eltwise1"
  top: "RDB2_9_Eltwise2"
}

layer {
  name: "RDB2_9c"
  type: "Convolution"
  bottom: "RDB2_9_Eltwise2"
  top: "RDB2_9c"
  param {name: "RDB9c_w"}
  param {name: "RDB9c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_9c_PReLU"
  type: "PReLU"
  bottom: "RDB2_9c"
  top: "RDB2_9c"
}

layer {
  name: "RDB2_9c1"
  type: "Convolution"
  bottom: "RDB2_9c"
  top: "RDB2_9c1"
  param {name: "RDB9c1_w"}
  param {name: "RDB9c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_9_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_9_Eltwise2"
  bottom: "RDB2_9c1"
  top: "RDB2_9_Eltwise3"
}

layer {
  name: "RDB2_9d"
  type: "Convolution"
  bottom: "RDB2_9_Eltwise3"
  top: "RDB2_9d"
  param {name: "RDB9d_w"}
  param {name: "RDB9d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_9d_Sum"
	type: "Eltwise"
	bottom: "RDB2_8d_Sum"
	bottom: "RDB2_9d"
	top: "RDB2_9d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_10a"
  type: "Convolution"
  bottom: "RDB2_9d_Sum"
  top: "RDB2_10a"
  param {name: "RDB10a_w"}
  param {name: "RDB10a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_10a_PReLU"
  type: "PReLU"
  bottom: "RDB2_10a"
  top: "RDB2_10a"
}

layer {
  name: "RDB2_10a1"
  type: "Convolution"
  bottom: "RDB2_10a"
  top: "RDB2_10a1"
  param {name: "RDB10a1_w"}
  param {name: "RDB10a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_10_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_9d_Sum"
  bottom: "RDB2_10a1"
  top: "RDB2_10_Eltwise1"
}

layer {
  name: "RDB2_10b"
  type: "Convolution"
  bottom: "RDB2_10_Eltwise1"
  top: "RDB2_10b"
  param {name: "RDB10b_w"}
  param {name: "RDB10b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_10b_PReLU"
  type: "PReLU"
  bottom: "RDB2_10b"
  top: "RDB2_10b"
}

layer {
  name: "RDB2_10b1"
  type: "Convolution"
  bottom: "RDB2_10b"
  top: "RDB2_10b1"
  param {name: "RDB10b1_w"}
  param {name: "RDB10b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_10_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_10b1"
  bottom: "RDB2_10_Eltwise1"
  top: "RDB2_10_Eltwise2"
}

layer {
  name: "RDB2_10c"
  type: "Convolution"
  bottom: "RDB2_10_Eltwise2"
  top: "RDB2_10c"
  param {name: "RDB10c_w"}
  param {name: "RDB10c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_10c_PReLU"
  type: "PReLU"
  bottom: "RDB2_10c"
  top: "RDB2_10c"
}

layer {
  name: "RDB2_10c1"
  type: "Convolution"
  bottom: "RDB2_10c"
  top: "RDB2_10c1"
  param {name: "RDB10c1_w"}
  param {name: "RDB10c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_10_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_10_Eltwise2"
  bottom: "RDB2_10c1"
  top: "RDB2_10_Eltwise3"
}

layer {
  name: "RDB2_10d"
  type: "Convolution"
  bottom: "RDB2_10_Eltwise3"
  top: "RDB2_10d"
  param {name: "RDB10d_w"}
  param {name: "RDB10d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_10d_Sum"
	type: "Eltwise"
	bottom: "RDB2_9d_Sum"
	bottom: "RDB2_10d"
	top: "RDB2_10d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_11a"
  type: "Convolution"
  bottom: "RDB2_10d_Sum"
  top: "RDB2_11a"
  param {name: "RDB11a_w"}
  param {name: "RDB11a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_11a_PReLU"
  type: "PReLU"
  bottom: "RDB2_11a"
  top: "RDB2_11a"
}

layer {
  name: "RDB2_11a1"
  type: "Convolution"
  bottom: "RDB2_11a"
  top: "RDB2_11a1"
  param {name: "RDB11a1_w"}
  param {name: "RDB11a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_11_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_10d_Sum"
  bottom: "RDB2_11a1"
  top: "RDB2_11_Eltwise1"
}

layer {
  name: "RDB2_11b"
  type: "Convolution"
  bottom: "RDB2_11_Eltwise1"
  top: "RDB2_11b"
  param {name: "RDB11b_w"}
  param {name: "RDB11b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_11b_PReLU"
  type: "PReLU"
  bottom: "RDB2_11b"
  top: "RDB2_11b"
}

layer {
  name: "RDB2_11b1"
  type: "Convolution"
  bottom: "RDB2_11b"
  top: "RDB2_11b1"
  param {name: "RDB11b1_w"}
  param {name: "RDB11b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_11_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_11b1"
  bottom: "RDB2_11_Eltwise1"
  top: "RDB2_11_Eltwise2"
}

layer {
  name: "RDB2_11c"
  type: "Convolution"
  bottom: "RDB2_11_Eltwise2"
  top: "RDB2_11c"
  param {name: "RDB11c_w"}
  param {name: "RDB11c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_11c_PReLU"
  type: "PReLU"
  bottom: "RDB2_11c"
  top: "RDB2_11c"
}

layer {
  name: "RDB2_11c1"
  type: "Convolution"
  bottom: "RDB2_11c"
  top: "RDB2_11c1"
  param {name: "RDB11c1_w"}
  param {name: "RDB11c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_11_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_11_Eltwise2"
  bottom: "RDB2_11c1"
  top: "RDB2_11_Eltwise3"
}

layer {
  name: "RDB2_11d"
  type: "Convolution"
  bottom: "RDB2_11_Eltwise3"
  top: "RDB2_11d"
  param {name: "RDB11d_w"}
  param {name: "RDB11d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_11d_Sum"
	type: "Eltwise"
	bottom: "RDB2_10d_Sum"
	bottom: "RDB2_11d"
	top: "RDB2_11d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "RDB2_12a"
  type: "Convolution"
  bottom: "RDB2_11d_Sum"
  top: "RDB2_12a"
  param {name: "RDB12a_w"}
  param {name: "RDB12a_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_12a_PReLU"
  type: "PReLU"
  bottom: "RDB2_12a"
  top: "RDB2_12a"
}

layer {
  name: "RDB2_12a1"
  type: "Convolution"
  bottom: "RDB2_12a"
  top: "RDB2_12a1"
  param {name: "RDB12a1_w"}
  param {name: "RDB12a1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_12_Eltwise1"
  type: "Eltwise"
  bottom: "RDB2_11d_Sum"
  bottom: "RDB2_12a1"
  top: "RDB2_12_Eltwise1"
}

layer {
  name: "RDB2_12b"
  type: "Convolution"
  bottom: "RDB2_12_Eltwise1"
  top: "RDB2_12b"
  param {name: "RDB12b_w"}
  param {name: "RDB12b_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "RDB2_12b_PReLU"
  type: "PReLU"
  bottom: "RDB2_12b"
  top: "RDB2_12b"
}

layer {
  name: "RDB2_12b1"
  type: "Convolution"
  bottom: "RDB2_12b"
  top: "RDB2_12b1"
  param {name: "RDB12b1_w"}
  param {name: "RDB12b1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_12_Eltwise2"
  type: "Eltwise"
  bottom: "RDB2_12b1"
  bottom: "RDB2_12_Eltwise1"
  top: "RDB2_12_Eltwise2"
}

layer {
  name: "RDB2_12c"
  type: "Convolution"
  bottom: "RDB2_12_Eltwise2"
  top: "RDB2_12c"
  param {name: "RDB12c_w"}
  param {name: "RDB12c_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}
layer {
  name: "RDB2_12c_PReLU"
  type: "PReLU"
  bottom: "RDB2_12c"
  top: "RDB2_12c"
}

layer {
  name: "RDB2_12c1"
  type: "Convolution"
  bottom: "RDB2_12c"
  top: "RDB2_12c1"
  param {name: "RDB12c1_w"}
  param {name: "RDB12c1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "RDB2_12_Eltwise3"
  type: "Eltwise"
  bottom: "RDB2_12_Eltwise2"
  bottom: "RDB2_12c1"
  top: "RDB2_12_Eltwise3"
}

layer {
  name: "RDB2_12d"
  type: "Convolution"
  bottom: "RDB2_12_Eltwise3"
  top: "RDB2_12d"
  param {name: "RDB12d_w"}
  param {name: "RDB12d_b"}
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    } 
  }
}

layer {
	name: "RDB2_12d_Sum"
	type: "Eltwise"
	bottom: "RDB2_11d_Sum"
	bottom: "RDB2_12d"
	top: "RDB2_12d_Sum"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "Dark_conv2_1"
  type: "Convolution"
  bottom: "RDB2_12d_Sum"
  top: "Dark_conv2_1"
  param {name: "Dark1_w"}
  param {name: "Dark1_b"}
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

